// 考试信息页，考试状态，不要轻易修改
/*
 * 1x：报名阶段------------------------当前时间小于报名截止时间
 * 2x：签到前（无论是否有报名）---------当前时间大于报名截止时间，小于签到开始时间
 * 3x：签到阶段------------------------当前时间大于签到开始时间，小于签到截止时间
 * 4x：考试前（无论是否有报名、签到）----当前时间大于签到截止时间，小于考试开始时间
 * 5x：考试阶段------------------------当前时间大于考试开始时间，小于考试截止时间
 * 6x：考试后--------------------------当前时间大于考试结束时间且手动公布答案公布前
 * 7x：答案公布后----------------------手动公布答案公布后
 */
const MExamStatusMap = new Map([
  [10, '报名阶段，且未报名'],
  [11, '报名阶段，且已报名'],
  [20, '签到前'],
  [30, '签到阶段，且未签到'],
  [31, '签到阶段，且已签到'],
  [40, '考试前'],
  [50, '考试阶段，未开考'],
  [51, '考试阶段，答题中'],
  [52, '考试阶段，已交卷'],
  [60, '考试结束，答案未公布'],
  [70, '答案已公布'],
]);

const MExamProcessStatusMap = new Map([
  [10, '未开始'],
  [20, '考试中'],
  [30, '已结束'],
]);

export { MExamStatusMap, MExamProcessStatusMap };
